
## SIT-GL: 授業用のOpenGLを使った簡易グラフィックライブラリ（windows g++/MinGW用）

環境構築までの手順

（１）freeglutをダウンロードしてフォルダにコピー（PC教室環境によっては既にコピーされている）
     https://www.transmissionzero.co.uk/software/freeglut-devel/
     からファイルをダウンロード．
     https://tana-laevatein.hatenadiary.org/entry/20091227/1261942906
     にある手順にしたがって，ダウンロード．その後に解凍（展開）．
     ・解凍したfreeglutフォルダ中の「lib」の中の，拡張子「.a」のファイルの全てを，MinGW側の「lib」フォルダにコピー．
     ・解凍したfreeglutフォルダ中の「include」の中の，「GL」というフォルダを，MinGW側の「include」フォルダにコピー．すでにGLのフォルダがある場合でも上書きしてもよい．
     ・解凍したfreeglutフォルダ中の「freeglut.dll」のファイルを，パスが通っているフォルダにコピーしておく．
     
（２）ファイル類のダウンロード
     本サイトからファイルをダウンロードする．
     
     ダウンロード後，解凍（展開）する．

（３）freeglutでのコンパイルが可能かのテスト
解凍したファイルの中を，コマンドラインで実行する．
・コマンドがない，何かおかしい
・「ファイルがない」のエラー，g++が動作しているので，これでよい（次に行く）


（４）テストプログラムの実行（freegultが実行可能かのテスト）
コマンドラインで.batを実行．
または，.batをダブルクリックして実行．

下記のようなテストプログラムが実行されればOK．wasdで「消しゴム」の画像が移動します．Xキーを押すと，消しゴム発射．



ーーーー
点の表示のみのサンプルプログラムのコンパイルと実行．


ーーーー
以降，リファレンスマニュアル

point()

line()

rect()

text()

imageBMP()
24ビットのみ

delay()

KeyDownについて
コールバック関数になっている












